INSERT INTO roles(name) VALUES ('admin'), ('user');


INSERT INTO actors (name, surname, patronymic, birthday, sex, information) VALUES
('Райан', 'Томас Гослинг', '', DATE('12/11/1980'), 'm', 'Томас Гослинг Райан'),
('Киллиан', 'Мерфи', '', DATE('05/25/1976'), 'm', null),
('Питер', 'Хейден Динклэйдж', '', DATE('11/06/1969'), 'm', null),
('Кристиан', 'Бэйл', '', DATE('01/30/1974'), 'm', null),
('Леонардо', 'ДиКаприо', '', DATE('11/11/1974'), 'm', null),
('Брэд', ' Питт', '', DATE('12/18/1963'), 'm', null),
('Эдвард', ' Нортон', '', DATE('08/18/1969'), 'm', null),
('Рами', 'Малек', '', DATE('12/05/1981'), 'm', null),
('Сэмюэл', 'Л. Джексон','', DATE('12/21/1948'),'m', null),
('Брайан', 'Крэнстон','', DATE('7/03/1956'), 'm', null),
('Мэтью', 'Макконахи', '', DATE('4/11/1969'), 'm', null),
('Сергей', 'Бодров', '', DATE('12/27/1971'), 'm', null),
('Тоби',  'Магуайр', '', DATE('06/27/1975'), 'm', null);


INSERT INTO films (title, year, information, rating) VALUES
('Оппенгеймер', 2023, '03:00', 9.0),
('Бойцовский клуб', 1999, '02:19', 9.1),
('Начало', 2010, '02:19', 8.9),
('Криминальное чтиво', 1994, '02:34', 8.5),
('Джентльмены', 2019 , '1:53', 8.6),
('Брат', 1997, '1:40', 8.6),
('Брат 2', 2000,  '2:07', 8.6),
('Человек-паук', 2002, '2:01', 8.3),
('Человек-паук 2', 2004, '2:07', 8.2),
('Человек-паук 3', 2007, '2:19', 8.1),
('Ходячий замок', 2004, '1:59', 8.1),
('Бесславные ублюдки', 2009, '2:34', 8.9),
('Однажды в... Голливуде', 2019, '2:41', 8.7);

INSERT INTO films_actors (film_id, actor_id) VALUES
(1, 2),
(2, 6),
(3, 5),
(4 ,9),
(5, 11),
(6, 12),
(7, 12),
(8, 13),
(9, 13),
(10, 13),
(12, 6),
(13, 6),
(13, 5);